<h1>DataFrame</h1>

In [1]:
import pandas as pd

In [4]:
emp_d = pd.DataFrame()
print(emp_d)

Empty DataFrame
Columns: []
Index: []

In [8]:
lst = ["a","b","c","d"]
print(lst)
pd.DataFrame(lst,index=[10,20,30,40])

['a', 'b', 'c', 'd']

    0
10  a
20  b
30  c
40  d

In [9]:
pd.DataFrame([[1,2,3],[11,12,13],[21,22,23]])

    0   1   2
0   1   2   3
1  11  12  13
2  21  22  23

In [14]:
dic1 = {
    "id":[11,12,13,14,15,16,17],
    "sn":[1,2,3,4,5,6,7]
}
pd.DataFrame(dic1)

   id  sn
0  11   1
1  12   2
2  13   3
3  14   4
4  15   5
5  16   6
6  17   7

In [15]:
sr_dict = {"id":pd.Series([11,1,1,12,3,43,4]),"sn":pd.Series([1,2,3,4,54])}

In [19]:
pd.DataFrame(sr_dict)

   id    sn
0  11   1.0
1   1   2.0
2   1   3.0
3  12   4.0
4   3  54.0
5  43   NaN
6   4   NaN

In [20]:
import pandas as pd

In [21]:
pd.DataFrame()

Empty DataFrame
Columns: []
Index: []

In [22]:
lst = [1,2,3,4,5]
pd.DataFrame(lst)

   0
0  1
1  2
2  3
3  4
4  5

In [23]:
dic_t = pd.DataFrame({
    "id":[1,2,3,4,6],
    "s":[11,12,13,14,16]
}) 
dic_t

   id   s
0   1  11
1   2  12
2   3  13
3   4  14
4   6  16

In [29]:
lst_dic = [{"name":["musfik","tamim","rahman"],"age":[17,18,19]}]
pd.DataFrame(lst_dic)

            age                     name
0  [17, 18, 19]  [musfik, tamim, rahman]

In [30]:
sr_dic = pd.DataFrame({
    "a":pd.Series([1,2,3,4,5]),
    "b":pd.Series([10,11,12])
})
pd.DataFrame(sr_dic)

   a     b
0  1  10.0
1  2  11.0
2  3  12.0
3  4   NaN
4  5   NaN